#+title: Sprint Backlog 30
#+options: date:nil toc:nil author:nil num:nil
#+todo: ANALYSIS IMPLEMENTATION TESTING | COMPLETED CANCELLED
#+tags: story(s) epic(e) task(t) note(n) spike(p)

* Stories

This file contains all stories that were closed during sprint 30.

** Development Stories Implemented

#+begin: clocktable :maxlevel 3 :scope subtree
Clock summary at [2014-05-27 Tue 13:03]

| Headline                                            | Time    |       |       |
|-----------------------------------------------------+---------+-------+-------|
| *Total time*                                        | *19:25* |       |       |
|-----------------------------------------------------+---------+-------+-------|
| Development Stories Implemented                     |         | 19:25 |       |
| COMPLETED Sprint and product backlog grooming       |         |       |  0:21 |
| CANCELLED Update C++ model after latest SML changes |         |       | 19:04 |
#+end:

*** COMPLETED Sprint and product backlog grooming                       :task:
    CLOSED: [2013-07-15 Mon 07:55]
    CLOCK: [2013-07-02 Tue 07:50]--[2013-07-02 Tue 07:54] =>  0:03
    CLOCK: [2013-06-30 Sun 22:28]--[2013-06-30 Sun 22:29] =>  0:01
    CLOCK: [2013-06-30 Sun 22:00]--[2013-06-30 Sun 22:16] =>  0:16

*** CANCELLED Update C++ model after latest SML changes
    CLOCK: [2013-07-02 Tue 07:47]--[2013-07-02 Tue 08:20] =>  0:33
    CLOCK: [2013-07-02 Tue 07:33]--[2013-07-02 Tue 07:42] =>  0:09
    CLOCK: [2013-07-01 Mon 13:20]--[2013-07-01 Mon 14:30] =>  1:10
    CLOCK: [2013-07-01 Mon 20:10]--[2013-07-01 Mon 23:30] =>  3:20

**** COMPLETED Update transformer
     CLOSED: [2013-07-14 Sun 14:11]
     CLOCK: [2013-07-14 Sun 00:51]--[2013-07-14 Sun 01:38] =>  0:47
     CLOCK: [2013-07-13 Sat 22:23]--[2013-07-14 Sun 00:51] =>  2:28
     CLOCK: [2013-07-12 Fri 07:47]--[2013-07-12 Fri 08:36] =>  0:49
     CLOCK: [2013-07-11 Thu 22:01]--[2013-07-11 Thu 23:50] =>  1:49
     CLOCK: [2013-07-11 Thu 18:14]--[2013-07-11 Thu 18:22] =>  0:08
     CLOCK: [2013-07-11 Thu 17:54]--[2013-07-11 Thu 18:02] =>  0:08
     CLOCK: [2013-07-11 Thu 17:47]--[2013-07-11 Thu 17:53] =>  0:06
     CLOCK: [2013-07-11 Thu 08:26]--[2013-07-11 Thu 08:34] =>  0:08
     CLOCK: [2013-07-11 Thu 07:47]--[2013-07-11 Thu 08:20] =>  0:33
     CLOCK: [2013-07-11 Thu 07:36]--[2013-07-11 Thu 07:44] =>  0:08
     CLOCK: [2013-07-09 Tue 08:24]--[2013-07-09 Tue 08:35] =>  0:11
     CLOCK: [2013-07-09 Tue 07:46]--[2013-07-09 Tue 08:16] =>  0:30
     CLOCK: [2013-07-09 Tue 07:33]--[2013-07-09 Tue 07:44] =>  0:11
     CLOCK: [2013-07-02 Tue 07:54]--[2013-07-02 Tue 08:20] =>  0:26

**** COMPLETED Update specs
     CLOSED: [2013-07-14 Sun 23:24]
     CLOCK: [2013-07-14 Sun 23:09]--[2013-07-14 Sun 23:24] =>  0:15
     CLOCK: [2013-07-14 Sun 22:01]--[2013-07-14 Sun 23:09] =>  1:08
     CLOCK: [2013-07-14 Sun 14:11]--[2013-07-14 Sun 17:00] =>  2:49
     CLOCK: [2013-07-14 Sun 13:11]--[2013-07-14 Sun 14:11] =>  1:00

**** CANCELLED Update workflow
     CLOCK: [2013-07-14 Sun 23:26]--[2013-07-14 Sun 23:44] =>  0:18

** Deprecated Development Stories
